/*
============================================================================
 Набор Рарог Фреймворка <https://github.com/TheSkiF4er/Rarog-Framework-Kit/>
----------------------------------------------------------------------------
 Автор: SkiF4er <rarog@skif4er.ru>.
----------------------------------------------------------------------------
 Авторские права (c) 2022 SkiF4er. Данный код защищен авторскими правами.
============================================================================
 Лицензия: Creative Commons Attribution-ShareAlike 4 Всемирная.
============================================================================
 Файл: rarog.js
----------------------------------------------------------------------------
 Внешнее подключение: https://skif4er.ru/osp/rarogjs
============================================================================
*/
function Translit () {
 var res = '';
 var text = document.getElementById('text').value;
 var transl = {А:'A', а:'a', Б:'B', б:'b', В:'V', в:'v', Г:'G', г:'g',
 Д:'D', д:'d', Е:'E', е:'e', Ё:'Yo', ё:'yo', Ж:'Zh', ж:'zh', З:'Z', з:'z',
 И:'I', и:'i', Й:'J', й:'j', К:'K', к:'k', Л:'L', л:'l', М:'M', м:'m',
 Н:'N', н:'n', О:'O', о:'o', П:'P', п:'p', Р:'R', р:'r', С:'S', с:'s',
 Т:'T', т:'t', У:'U', у:'u', Ф:'F', ф:'f', Х:'X', х:'x', Ц:'Cz', ц:'cz',
 Ч:'Ch', ч:'ch', Ш:'Sh', ш:'sh', Щ:'Shh', щ:'shh', Ъ:'"', ъ:'"', Ы:'Y\'', ы:'y\'',
 Ь:'\'', ь:'\'', Э:'E\'', э:'e\'', Ю:'Yu', ю:'yu', Я:'Ya', я:'ya', ' ':'_'};
 for(i=0;i<text.length;i++) {
  if(transl[text[i]]!=undefined) res += transl[text[i]];
  else res += text[i];
 }
 res = res.replace(/Cz(?=i|e|y|j|I|E|Y|J)/g, "C");
 res = res.replace(/cz(?=i|e|y|j|I|E|Y|J)/g, "c");
 document.getElementById('text').value = res;
}
